---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.CodeCheckingStatus
source: html/2f3f13cf-6064-1b99-332e-c4d8f83e9ec1.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.CodeCheckingStatus Property

Code checking status of the structural connection.

## Syntax (C#)
```csharp
public StructuralConnectionCodeCheckingStatus CodeCheckingStatus { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration